---
kind: method
id: M:Autodesk.Revit.DB.FabricationService.ResetServiceExclusionOverrides
source: html/8f03af55-9ed3-1695-a046-06973e7e0322.htm
---
# Autodesk.Revit.DB.FabricationService.ResetServiceExclusionOverrides Method

Resets the overridden service palette and button exclusions back to default, as defined by the configuration.

## Syntax (C#)
```csharp
public void ResetServiceExclusionOverrides()
```

## Exceptions
- **Autodesk.Revit.Exceptions.DisabledDisciplineException** - None of the following disciplines is enabled: Mechanical Electrical Piping.